lte_pdcch_epdcch.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-02-15 Thu 01:00 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>LTE - PDCCH &amp; EPDCCH</title>
<meta name="author" content="shaka" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="default.css"/>

</head>
<body>
<div id="content" class="content">
<h1 class="title">LTE - PDCCH &amp; EPDCCH</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orge2a63b7">Introduction</a></li>
<li><a href="#org13c6e1d">PDCCH</a></li>
<li><a href="#org97f68b2">EPDCCH</a></li>
<li><a href="#orgc98cf4c">Blind decoding of PDCCH and EPDCCH</a>
<ul>
<li><a href="#org3594ab3">PDCCH</a></li>
<li><a href="#orgb13b515">EPDCCH</a></li>
<li><a href="#orgde145f5">Blind decoding attempts</a></li>
</ul>
</li>
<li><a href="#org1415c90">Transmission mode (TM) signalling</a></li>
</ul>
</div>
</div>

<div id="outline-container-orge2a63b7" class="outline-2">
<h2 id="orge2a63b7">Introduction</h2>
<div class="outline-text-2" id="text-orge2a63b7">
<p>
This post provides a brief summary on <i>physical downlink control channel (PDCCH)</i> and <i>enhanced physical downlink control channel (EPDCCH)</i> in long term evolution (LTE). Note the summary is based on the famous book, <i>4G, LTE-Advanced Pro and the Road to 5G</i><sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>.
</p>
</div>
</div>

<div id="outline-container-org13c6e1d" class="outline-2">
<h2 id="org13c6e1d">PDCCH</h2>
<div class="outline-text-2" id="text-org13c6e1d">
<p>
PDCCH carries <i>downlink control information (DCI)</i>, e.g. scheduling decisions and power control commands. Since each scheduling message is transmitted on a separate PDCCH, there are multiple simultaneous PDCCH transmission within each cell. From a UE perspective, each UE can receive multiple DCI messages in the same subframe, e.g. it is scheduled simultaneously in uplink and downlink.
</p>

<p>
Different control information can be categorized into different <i>DCI formats</i>, each of which corresponds with a certain message size<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup> and usage.
</p>

<p>
A DCI payload is first attached with a CRC which is scrambled by a <i>radio network temporary identifier (RNTI)</i><sup><a id="fnr.3" class="footref" href="#fn.3" role="doc-backlink">3</a></sup>, and then coded with a 1/3 tail-biting convolutional code<sup><a id="fnr.4" class="footref" href="#fn.4" role="doc-backlink">4</a></sup> and rate-matched to fit the amount of resources for PDCCH transmission. After the rate matching, the bit sequence is scrambled by a cell-specific and subframe-specific scrambling sequence to whiten and randomize the inter-cell interference (ICI) before QPSK modulation and mapping to resource elements (RE's).
</p>

<p>
The mapping of PDCCH is based on a conception of <i>control channel element (CCE)</i>, which is essentially a simple representation of 9 REG's, i.e. 36 RE's. Each PDCCH can take up 1, 2, 4 or 8 CCE's for link adaptation. The number of CCE's used for a PDCCH is termed <i>aggregation level</i>. The number of CCE's available for PDCCH depends on the size of control region, the cell bandwidth, the number of antenna ports in the downlink, and the resources occupied by PHICH.
</p>

<p>
Since a UE is not signalled about the aggregation level of each PDCCH, it has to blindly decode it. In order to reduce the computational complexity, some restrictions are imposed, e.g. each aggregated CCE can only start with the CCE's with their indices divisible by its aggregation level.
</p>
</div>
</div>

<div id="outline-container-org97f68b2" class="outline-2">
<h2 id="org97f68b2">EPDCCH</h2>
<div class="outline-text-2" id="text-org97f68b2">
<p>
EPDCCH was introduced as a complementary control channel in release 11. Different from PDCCH, EPDCCH can use precoding and be detected based on DMRS. Moreover, EPDCCH is mapped to PDSCH region.
</p>

<p>
Correspondingly, the mapping of EPDCCH is based on <i>enhanced control channel element (ECCE)</i> and <i>enhanced resource elements group (EREG)</i>. Each ECCE comprises of 4 EREG's<sup><a id="fnr.5" class="footref" href="#fn.5" role="doc-backlink">5</a></sup>, and each EREG consists on 9 RE's<sup><a id="fnr.6" class="footref" href="#fn.6" role="doc-backlink">6</a></sup> in one PRB pair. To define an EREG, number all the RE's in a PRB pair cyclically in a frequency-first manner from 0 to 15, excluding the RE's for DMRS. EREG \(i\) consists of all RE's with number \(i\) in that PRB pair<sup><a id="fnr.7" class="footref" href="#fn.7" role="doc-backlink">7</a></sup>. Therefore, there are 16 EREG's in one PRB pair.
</p>

<p>
For link adaptation, each EPDCCH can correspond with one or more ECCE's, and the aggregation level can be 1, 2, 4, 8, 16 or 32.
</p>

<p>
The mapping of ECCE to EREG is different for localized and distributed transmission. For localized transmission, an ECCE is mapped to EREG's in the same PRB pair. Only if one PRB pair is not sufficient to carry one EPDCCH, e.g. for the highest aggregation levels, a second PRB pair is used. A single antenna port is adopted for EPDCCH transmission. The associated DMRS is a function of the ECCE index and the C-RNTI. At most 4 UE's can be multiplexed for MU-MIMO transmission. For distributed transmission, an ECCE is mapped to EREG's in different PRB pairs.
</p>
</div>
</div>

<div id="outline-container-orgc98cf4c" class="outline-2">
<h2 id="orgc98cf4c">Blind decoding of PDCCH and EPDCCH</h2>
<div class="outline-text-2" id="text-orgc98cf4c">
<p>
A <i>search space</i> is a set of candidate control channels formed by CCE's/ECCE's at a given aggregation level, which a UE attempts to decode. 
</p>
</div>

<div id="outline-container-org3594ab3" class="outline-3">
<h3 id="org3594ab3">PDCCH</h3>
<div class="outline-text-3" id="text-org3594ab3">
<p>
Each UE has a <i>UE-specific search space</i> at each aggregation level. UE-specific search spaces for PDCCH are defined as a function of the UE identity and the subframe number. Thus, UE-specific search space is different from one subframe to another.
</p>

<p>
Besides, <i>common search spaces</i> are defined for PDCCH, which is allowed to address a group of or all the UE's in the system, e.g. the dynamic scheduling of system information, paging transmission, power control commands. Clearly, common search spaces are primarily defined for system-wide information and consequently only the DCI formats with smallest payload sizes (0/1A/3/3A and 1C) and the aggregation levels of 4 and 8 are supported only for better reliability and coverage. However, the common search spaces can also be used to schedule individual UE's, especially when the scheduling of a UE is blocked due to the lack of available resources in the UE-specific search space of the UE.
</p>

<p>
There are 16 and 9 PDCCH candidates in the UE-specific and common search spaces, respectively.
</p>
</div>
</div>
<div id="outline-container-orgb13b515" class="outline-3">
<h3 id="orgb13b515">EPDCCH</h3>
<div class="outline-text-3" id="text-orgb13b515">
<p>
Basically, EPDCCH blind decoding follows the same principles as PDCCH. What is different, only UE-specific search spaces are supported<sup><a id="fnr.8" class="footref" href="#fn.8" role="doc-backlink">8</a></sup>. Given a UE configured to use EPDCCH, it monitors the EPDCCH UE-specific search spaces in lieu of PDCCH UE-specific search spaces. The common search spaces of PDCCH are always monitored regardless whether an EPDCCH is configured.
</p>
</div>
</div>
<div id="outline-container-orgde145f5" class="outline-3">
<h3 id="orgde145f5">Blind decoding attempts</h3>
<div class="outline-text-3" id="text-orgde145f5">
<p>
The number of blind decoding attempts is the same for PDCCH and EPDCCH. Hence, a UE needs to carry out \(2 \times 16 + 2 \times 6 = 44\) blind decoding attempts. With uplink spatial multiplexing introduced in release 10, an additional uplink DCI format needs to be monitored in the UE-specific search space, i.e. \(3 \times 16 + 2 \times 6 = 60\) attempts.
</p>
</div>
</div>
</div>
<div id="outline-container-org1415c90" class="outline-2">
<h2 id="org1415c90">Transmission mode (TM) signalling</h2>
<div class="outline-text-2" id="text-org1415c90">
<p>
TM is configured by RRC signalling, but the exact subframe number from which the configuration takes effect is not specified. Therefore, there is confusion of TM between network and UE at least in a duration. In this case,  it is necessary to define a TM-independent DCI format, i.e. 1A.
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Erik Dahlman, Stefan Parkvall and Johan Sköld. "4G, LTE-Advanced Pro and the Road to 5G", 3rd edition.
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
The actual message size of DCI depends on DCI format and cell bandwidth.
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3" role="doc-backlink">3</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Different RNTI's are used for different purpose of the DCI messages, e.g. UE-specific C-RNTI is used for normal unicast data transmission.
</p></div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4" role="doc-backlink">4</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Instead of using tail bits, the convolutional code encoder is initialized with the last bits of the message before encoding. Therefore, the starting and ending states in the trellis in an Viterbi decoder are identical.
</p></div></div>

<div class="footdef"><sup><a id="fn.5" class="footnum" href="#fnr.5" role="doc-backlink">5</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Each ECCE has 4 EREG's for normal CP, and 8 EREG's for extended CP and some special subframe configurations in normal CP.
</p></div></div>

<div class="footdef"><sup><a id="fn.6" class="footnum" href="#fnr.6" role="doc-backlink">6</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Each EREG has 9 RE's for normal CP and 8 RE's for extended CP.
</p></div></div>

<div class="footdef"><sup><a id="fn.7" class="footnum" href="#fnr.7" role="doc-backlink">7</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Note that not all the RE's in an EREG are available for EPDCCH since some RE's are occupied, e.g. by PDCCH control region, CRS, or CSI-RS.
</p></div></div>

<div class="footdef"><sup><a id="fn.8" class="footnum" href="#fnr.8" role="doc-backlink">8</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Because system information should be provided to all the UE's, including the legacy ones not supporting EPDCCH, common search spaces for PDCCH is enough and the counterpart for EPDCCH is not necessary.
</p></div></div>


</div>
</div></div>
</body>
</html>
